* COBOL MORTUARY
* Virtual MORGUE - 
* 
* by surender, MORTUARY
* 


        IDENTIFICATION DIVISION.                
        PROGRAM-ID. PRG1.                       
        ENVIRONMENT DIVISION.                   
        DATA DIVISION.                          
        PROCEDURE DIVISION.                     
               DISPLAY "MORTUARY!".          
               STOP RUN.               
